app/views/books/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."book_id" = ?  [["book_id", 1]]
---
          <td><%= render 'favorites/favorite', book: @book %></td>
          <td>コメント数：<%= @book.comments.count %></td>

SELECT "comments".* FROM "comments" WHERE "comments"."book_id" = ?  [["book_id", 1]]
---
      <table>
        <% @book.comments.each do |comment| %>